&НаСервере
function fnc_ФЛ_найти_создать_ФЛ_наСервере()
	
	var fncRes;
	var v_new_ФЛ;
	var s_FIO;
	
	fncRes = undefined; //ЭтотОбъект.рек_тзАтрибутыФЛ

	s_FIO = ЭтотОбъект.рек_тзАтрибутыФЛ[0].ФизлицоФИО;
	
	if s_FIO <> "" then	
		
		v_new_ФЛ = справочники.ФизическиеЛица.СоздатьЭлемент();
		v_new_ФЛ.Наименование	= s_FIO;
		//v_new_ФЛ.ГруппаДоступа	= справочники.ГруппыДоступаФизическихЛиц.НайтиПоНаименованию("Контрагенты");
		
		//v_new_ФЛ.Записать(); //записываем, чтобы получить Ссылку на объект, если нужна для передачи в качестве параметра метода
		
		////////////////////////////////////////
		//START работа с контактной информацией
		////////////////////////////////////////
				
		//добавление мобильного телефона в контакты
		ТелефонСтруктура = Новый Структура;
		ТелефонСтруктура.Вставить("Представление",  "+7 (123) 456-78-95");
		ТелефонСтруктура.Вставить("Комментарий",  	"тестовый номер");
		ТелефонСтруктура.Вставить("КодСтраны",     	"7");
		ТелефонСтруктура.Вставить("КодГорода",     	"123");
		ТелефонСтруктура.Вставить("НомерТелефона", 	"456-78-95");
			
		ТелефонXML 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(ТелефонСтруктура,"", Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТелефонJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ТелефонXML);

		
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(v_new_ФЛ, ТелефонJSON, 
											Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица, ТекущаяДатаСеанса(), Ложь);

		//УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(v_new_ФЛ.Ссылка, ТелефонJSON, 
		//									Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, ТекущаяДата(), Ложь);
		
		
		//добавление адреса в контакты
		//АдресСтруктура = Новый Структура;
		////119019, Москва г, Москва, Арбатская пл, дом № 1, корпус 2
		//АдресСтруктура.Вставить("Представление",  	"119019, Москва г, Арбатская пл, дом 1, корпус 2, квартира 3");
		//АдресСтруктура.Вставить("Комментарий", 		"тестовый адрес");
		//АдресСтруктура.Вставить("Страна",  			"РОССИЯ");
		//АдресСтруктура.Вставить("Город",  			"Москва");
		//АдресСтруктура.Вставить("Улица",  			"Арбатская пл");
		//АдресСтруктура.Вставить("Дом",  			"1");
		//АдресСтруктура.Вставить("Корпус",  			"2");
		//АдресСтруктура.Вставить("Квартира",  		"3");
		
		s_Адрес = "РОССИЯ, 334038, Иркутская обл, Иркутский муниципальный район, Молодежный п, Ангарская ул, дом 15, квартира 2";
		
		//АдресXML = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(АдресСтруктура,"", Перечисления.ТипыКонтактнойИнформации.Адрес);
		//АдресJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(АдресXML);
		
		АдресJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(s_Адрес, Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица);
		
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(v_new_ФЛ, АдресJSON, 
											Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица, ТекущаяДатаСеанса(), Истина);


		
		////////////////////////////////////////
		//END работа с контактной информацией
		////////////////////////////////////////
		
		v_new_ФЛ.Записать();
		message("Создано новое ФизЛицо: " + v_new_ФЛ.Наименование);
		
		fncRes = v_new_ФЛ.Ссылка;
		
	endIf;
	
	return fncRes;
	
endFunction