//удаляем строки из таблицы значений по критерию, чтобы остались строки:
//только с ИНН = "7750004023" и пустым ВидомДоговора

индекс = тзОстаткиОборотыВалюта_фильтр_7750004023.Количество() - 1; 
Пока индекс >= 0 Цикл
  s_ИНН = тзОстаткиОборотыВалюта_фильтр_7750004023[индекс].БанкИНН;
  s_ВидДоговора = тзОстаткиОборотыВалюта_фильтр_7750004023[индекс].ВидДоговора;
  Если s_ИНН <> "7750004023" тогда
    тзОстаткиОборотыВалюта_фильтр_7750004023.Удалить(индекс);
  ИначеЕсли s_ИНН = "7750004023" И ЗначениеЗаполнено(s_ВидДоговора) тогда
    тзОстаткиОборотыВалюта_фильтр_7750004023.Удалить(индекс);
  КонецЕсли; 
  индекс = индекс - 1;
КонецЦикла;
