//Расширение 1С.Документооборот КОРП 2.1

////////////////////////////////////////////////////
//Справочник ВнутренниеДокументы. Форма элемента.
////////////////////////////////////////////////////

//Модуль формы
//Добавлена новая страница (закладка) -- ГруппаДанныеКонтрагента. На странице созданы реквизиты -- ФИО, Адрес, Адрес (подробно), Банк
&НаКлиенте
Процедура РасшКонтрагентФЛ_рекФИООткрытиеПосле(Элемент, СтандартнаяОбработка) //кнопка открытия поля ФИО
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", , ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура РасшКонтрагентФЛ_рекАдресОткрытиеПосле(Элемент, СтандартнаяОбработка) //кнопка открытия поля Адрес
	СтандартнаяОбработка = Ложь;
	ФормаАдреса = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", , ЭтаФорма.УникальныйИдентификатор);
	ФормаАдреса.Открыть();
	ФормаАдреса.ТекущийЭлемент = ФормаАдреса.Элементы.ГруппаКонтактнаяИнформация;	
КонецПроцедуры

&НаКлиенте
Процедура РасшКонтрагентФЛ_рекАдресПодробноОткрытиеПосле(Элемент, СтандартнаяОбработка) //кнопка открытия поля Адрес (подробно)
	СтандартнаяОбработка = Ложь;
	ПараметрОткрытия = Новый Структура("ОткрытаПоСценарию", Истина);
	//ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрОткрытия);
	ФормаАдресаПодробно = ПолучитьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрОткрытия, ЭтаФорма.УникальныйИдентификатор);
	data_address = ФормаАдресаПодробно.ОткрытьМодально();
	//ФормаАдресаПодробно.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура РасшКонтрагентФЛ_рекБанкОткрытиеПосле(Элемент, СтандартнаяОбработка) //кнопка открытия поля Банк
	СтандартнаяОбработка = Ложь;		
	Если Объект.Ссылка.Пустая() Тогда		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 
			НСтр("ru = 'Данные еще не записаны.
	             |Создание ""Банковского счета"" возможно только после записи данных'"),
			РежимДиалогаВопрос.ОК);
	Иначе 
		СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец", Объект.Ссылка));
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта", СтруктураПараметров, ЭтаФорма, , , , ,
								      		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
КонецПроцедуры
