
Если тзВыборкаСделки.Количество() > 0 тогда
  Для Счетчик = 0 по тзВыборкаСделки.Количество() - 1 Цикл
    s_ВидИнфСообщ = ПолучитьИмяВидаИнфСообщ_ОКУД0420417(тзВыборкаСделки[Счетчик].Поле8);
    Если s_ВидИнфСообщ = "CANCEL" тогда //ищем сделку CANCEL
      ДатаЗаключенияСделки = тзВыборкаСделки[Счетчик].Поле4;	
      //проверка условия "Сделки, заключенные и расторгнутые внутри одного отчетного периода"
      Если (ДатаЗаключенияСделки >= НачалоМесяца(ДатаОтчета)) И (ДатаЗаключенияСделки <= КонецМесяца(ДатаОтчета)) тогда
        тзВыборкаСделки.Вставить(Счетчик);
        ЗаполнитьЗначенияСвойств(тзВыборкаСделки[Счетчик], тзВыборкаСделки[Счетчик + 1]);//заполняем значениями следующей строки
        тзВыборкаСделки[Счетчик].Поле8 = "5_NEW";
        Счетчик = Счетчик + 1;
      КонецЕсли;
    КонецЕсли;
  КонецЦикла;
КонецЕсли;

НомерСтроки = 1;
Для каждого элм из тзВыборкаСделки цикл //перенумеруем порядковый номер строк
  элм.Поле1 = НомерСтроки;
  НомерСтроки = НомерСтроки + 1;
КонецЦикла;
