function ПолучитьПоследнийРабочийДеньКонцаПериода(ДатаРасчета) 
	
	Перем Сч, НомМесяца;
	
	НомМесяца = Месяц(ДатаРасчета); // для проверки на один и тотже месяц при понижении даты
	
	ДатаРасчета = КонецДня(ДатаРасчета);
	Если НЕ Календарь.ЭтоРабочийДень(ДатаРасчета) Тогда
		
		Сч = 0;
		Пока НЕ Календарь.ЭтоРабочийДень(ДатаРасчета) Цикл
			Сч = Сч + 1;
			ДатаРасчета = ДатаРасчета - ДеньВСекундах();
			Если Сч > 30 ИЛИ Месяц(ДатаРасчета) <> НомМесяца Тогда
				Возврат Неопределено;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
	return НачалоДня(ДатаРасчета);
	
endFunction
