function ПреобразоватьМассивВТаблицуЗначений( arrData ) export

	тзResult = Новый ТаблицаЗначений;

	Для Каждого elm Из arrData Цикл
		
		// Рисуем колонки для таблицы
		Если тзResult.Колонки.Количество() = 0 Тогда
			Для Каждого ЗначениеСтруктуры Из elm Цикл
				тзResult.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
			КонецЦикла;
		КонецЕсли;

		// Добавляем данные в таблицу
		НоваяСтрока = тзResult.Добавить();
		Для Каждого ЗначениеСтруктуры Из elm Цикл
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;

	return тзResult;

endFunction
